org/research.org
#+STARTUP: showall indent hidestars

#+TITLE: Исследования и разработки

* Компиляторы и виртуальные машины

- Проверка корректности автоматных парсеров контекстно-свободных
  языков
- Автоматизация написания декомпиляторов для регисто-стековых
  виртуальных машин
- Построение алгоритмов и кодогенерация для конечно-автоматных
  распределенных виртуальных машин с разделяемым состоянием

* Распределенные системы

- Верификация протоколов обмена сообщениями в распределенных сетях

* Языки предметной области

- Создание языков предметной области систем автоматизированного
  принятия решений
- Построение и анализ средств визуального программирования для
  языков предметной области для систем реактивного управления
