www/research.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Исследования и разработки</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Исследования и разработки</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org884c40b">Компиляторы и виртуальные машины</a></li>
<li><a href="#orge3aef54">Распределенные системы</a></li>
<li><a href="#orge01d4bf">Языки предметной области</a></li>
</ul>
</div>
</div>

<div id="outline-container-org884c40b" class="outline-2">
<h2 id="org884c40b">Компиляторы и виртуальные машины</h2>
<div class="outline-text-2" id="text-org884c40b">
<ul class="org-ul">
<li>Проверка корректности автоматных парсеров контекстно-свободных
языков</li>
<li>Автоматизация написания декомпиляторов для регисто-стековых
виртуальных машин</li>
<li>Построение алгоритмов и кодогенерация для конечно-автоматных
распределенных виртуальных машин с разделяемым состоянием</li>
</ul>
</div>
</div>

<div id="outline-container-orge3aef54" class="outline-2">
<h2 id="orge3aef54">Распределенные системы</h2>
<div class="outline-text-2" id="text-orge3aef54">
<ul class="org-ul">
<li>Верификация протоколов обмена сообщениями в распределенных сетях</li>
</ul>
</div>
</div>

<div id="outline-container-orge01d4bf" class="outline-2">
<h2 id="orge01d4bf">Языки предметной области</h2>
<div class="outline-text-2" id="text-orge01d4bf">
<ul class="org-ul">
<li>Создание языков предметной области систем автоматизированного
принятия решений</li>
<li>Построение и анализ средств визуального программирования для
языков предметной области для систем реактивного управления</li>
</ul>
</div>
</div>
</div>
</body>
</html>
